<template>
  <div class="newsinfo-container">
    <h3 class="title">{{ this.newsinfo.title }}</h3>
    <p class="subtitle">
      <span>发表时间：{{ this.newsinfo.add_time }}</span>
      <span>点击：{{ this.newsinfo.click }}</span>
    </p>
    <hr />
    <div class="content" v-html="this.newsinfo.content"></div>

    <!-- 评论子组件 -->
    <comment-box :id="this.id"></comment-box>
  </div>
</template>

<script>
import comment from "../subcomponents/comment.vue";
export default {
  data() {
    return {
      id: this.$route.params.id, // 将 URL地址中传递过来的ID值 挂载到 Data上

      newsinfo: {
        title: "",
        add_time: "",
        click: 0,
        content: ""
      }
    };
  },
  created() {
    this.getShow();
  },
  methods: {
    getShow() {
      switch (parseInt(this.id)) {
        case 1:
          this.newsinfo.title = "支付宝上线大尺度照片 回应：删除违规内容";
          this.newsinfo.add_time = "2019-07-21 16:56";
          this.newsinfo.click = 326;
          this.newsinfo.content =
            '<p style="text-indent: 2em">近日，支付宝新上线校园日记和白领日记的社交圈子功能，部分用户上传大尺度照片，网友认为照片或涉嫌低俗，质疑支付宝有炒作之嫌。支付宝方面昨天表示，目前圈子处于测试中，对于发布含有色情等违规言论的行为，圈子管理员有权删除其动态，对账号做禁言，甚至拉黑账号。</p><p style="text-indent: 2em">据记者了解，校园日记和白领日记都是支付宝在上周新上线的两款带有社交属性的产品，此外新上的还有海外代购等社交圈。校园日记的规则介绍发布于11月24日晚，规则显示只有女大学生才可发布动态，其他用户可点赞和打赏，而只有女大学生和芝麻信用分大于等于750分的用户才可评论。白领日记圈子的规则发布于11月25日晚，同样显示为只有白领女士可以发布动态，称可聊职场经历及记录生活瞬间，而只有白领女士和芝麻信用分大于等于750分的用户才可评论。</p><p style="text-indent: 2em">支付宝方面称，在支付宝“圈子”内，对于发布含有色情、人身攻击、明显广告信息等违规言论的行为，圈子管理员有权删除其动态，对账号做禁言，甚至拉黑账号处理。目前圈子会根据类型控制加入门槛，甚至分享和评论权限。支付宝的合作伙伴的管理团队，也会针对一些不合规范的照片进行严格处理。</p>';
          break;
        case 2:
          this.newsinfo.title = "中国电子第一街从暴富神话到一夜空城";
          this.newsinfo.add_time = "2019-07-20 17:15";
          this.newsinfo.click = 98;
          this.newsinfo.content =
            '<p style="text-indent: 2em">30年前，华强北是深圳一条再普通不过的街，甚至算不上一条街，只不过是上步工业区的一条厂区马路而已。遭遇了电子商务的冲击、产业升级、地铁封路、山寨查货风暴之后，华强北该如何顺利实现“涅槃”成为关注的焦点。</p><p style="text-indent: 2em">在这样的光环下，暴富神话也是一个接一个。“以前华强北因山寨手机一战成名，10年前我在赛格广场的一个小铺位，一个月就能赚十几万，现在住的房子就是当时赚钱买的。”说起过去，在华强北做手机生意的陈老板显得有些感慨，“转型很难，放弃又不甘心，虽然现在生意大不如前，但我还是要感谢华强北。</p><p style="text-indent: 2em">不过，当山寨潮流迅速消融之后，华强北电子市场进入一个艰难而痛苦的时刻。</p><p style="text-indent: 2em">7号线的修建让华强北进入“封路”状态：从南到北的方向因地铁施工造成核心路段封堵，行人走道也已变得狭窄，货运车和私家车塞满了周边拥挤的小巷。遭遇了电子商务的冲击、产业升级、地铁封路、山寨查货风暴之后，光顾华强北的人流大幅减少，也导致大量实体商铺空置，出租率和租金价格都在下降，华强北“衰落”也是最近几年深圳市场经常讨论的话题。近日，记者在华强电子世界调查发现，部分一楼临街的店铺仍处于空置状态。</p><p style="text-indent: 2em">可以说，整个华强北片区就如同一个“综合体”。不过，记者调查发现，近几年特别是地铁围挡期间，整个华强北片区的城市更新除了华强北路两旁建筑翻新、振华路上的中航城、中电迪富大厦以及部分写字楼项目，旧住宅小区以及大多数旧厂房的更新似乎仍原地踏步，只有上步工业区的部分区域开始启动旧厂房改造项目。</p>';
          break;
        case 3:
          this.newsinfo.title = "广州武汉长沙同日齐出地王 为下次暴涨囤地？";
          this.newsinfo.add_time = "2019-07-17 16:19";
          this.newsinfo.click = 125;
          this.newsinfo.content =
            '<p style="text-indent: 2em">有知情人士表示，杭州、深圳、武汉三城新政只是第二轮调控收紧的开始。据介绍，此前重点调控的多个城市，一旦房价涨幅难降，均将继续采取收紧措施。此轮调控重点是不能出现大幅度的涨幅。因此，不仅仅只是名单重点城市从严调控，连续涨幅较高的城市都将是调控重点。这也意味着，部分涨幅较快的城市均将再次面临调控升级。</p><p style="text-indent: 2em">除了限购限贷，针对土拍的调控政策也升级。近日，南京和广州都发布通知，对参与土地拍卖的开发商，要求必须用其自有资金拿地，不得采用银行贷款、信托资金、资本市场融资、资管计划配资等来源。这意味着房企拿地必须使用自有资金。</p><p style="text-indent: 2em">易居研究院智库中心研究总监严跃进表示，从部分城市土地出让条件变化来看，也正在逐渐征求房企的意见。因为过于复杂或苛刻的出让条件，会间接推高房企拿地成本，尤其是地价测算成本。后续稳定土地市场的方向已经明确，其中将包括加大供应规模，以及对于部分过热市场继续进行各类新的管制。</p><p style="text-indent: 2em">严跃进指出，积极做好土地储备是目前房企的一个战略考虑。从实际情况看，后续可以通过在招拍挂市场主动拿地、积极并购其他房企项目、参与旧城改造来获取土地开发资格等。预计此类土地会在2017年末到2018年陆续形成可售房源，这也和此类房企对接下来房地产市场周期的走势判断有关。</p>';
          break;
        case 4:
          this.newsinfo.title = "统计局：10月一二线城市房地产市场明显降温";
          this.newsinfo.add_time = "2019-07-16 15:38";
          this.newsinfo.click = 489;
          this.newsinfo.content =
            '<p style="text-indent: 2em">统计局数据显示，10月70个大中城市新房房价出现明显降温，其中深圳、成都、乌鲁木齐、包头、牡丹江、泸州、南充7个城市房价下跌。成都下降0.8%，降幅最大。</p><p style="text-indent: 2em">为深入反映房地产市场动态变化，国家统计局继上月统计发布15个一线和热点二线城市10月上半月房价变动情况后，又对这些城市10月下半月的房价变动情况进行了统计。结果显示，一线和热点二线城市因地制宜、因城施策实施调控政策以来，房价走势明显趋稳。与10月上半月比，10月下半月新建商品住宅价格除深圳和成都2个城市继续下降外，北京、天津、上海、厦门和郑州等5个城市也由升转降，降幅在0.1至0.4个百分点之间;广州新建商品住宅价格环比持平;其余7个城市新建商品住宅价格环比涨幅进一步回落，回落幅度在0.4至3.3个百分点之间。</p><p style="text-indent: 2em">10月份，70个大中城市中，一线城市和二线城市房地产市场明显降温，房价环比涨幅快速回落。初步测算，10月份一、二线城市新建商品住宅价格环比分别上涨0.5%和1.3%，分别比9月份回落2.8和1.0个百分点;二手住宅价格环比分别上涨0.6%和0.8%，分别比9月份回落2.9和1.1个百分点。三线城市房价较为稳定。10月份三线城市新建商品住宅价格环比上涨0.9%，比9月份回落0.3个百分点;二手住宅价格环比上涨0.5%，比9月份回落0.3个百分点。此外，一线城市新建商品住宅和二手住宅价格同比涨幅也出现回落。</p>';
          break;
        case 5:
          this.newsinfo.title = "楼市调控第二波：杭州、武汉、深圳升级政策";
          this.newsinfo.add_time = "2019-07-15 17:45";
          this.newsinfo.click = 326;
          this.newsinfo.content =
            '<p style="text-indent: 2em">《深圳市住房公积金管理委员会关于调整住房公积金贷款首付款比例有关事项的通知》中明确提出，深圳市公积金贷款(包括商业性住房按揭贷款转住房公积金贷款)首付款比例执行为：住房公积金缴存职工家庭名下在本市无房，使用公积金贷款购买首套住房的，公积金贷款首付款比例最低为30%;职工家庭名下在本市拥有1套住房的，使用公积金贷款再次购房的，公积金贷款首付款比例不低于70%。</p><p style="text-indent: 2em">据市住房建设局公积金中心相关负责人介绍，职工家庭购买首套住房申请公积金贷款的，贷款利率仍为个人住房公积金贷款基准利率(5年以上为3.25%，5年及以下为2.75%);职工家庭名下在深圳已经拥有1套住房，再次购买住房时申请公积金贷款的，贷款利率为个人住房公积金贷款基准利率的1.1倍。购买第三套住房的不予申请公积金贷款。</p><p style="text-indent: 2em">明确在市区限购范围内，职工家庭购买首套普通自住住房，或拥有1套住房并已结清购房贷款的、为改善居住条件再次申请住房公积金贷款，首付款比例从不低于20%调整为不低于30%;拥有1套住房但未结清相应商业性购房贷款，再次申请住房公积金贷款购买普通自住住房的，首付款比例从不低于50%调整为不低于60%;拥有2套及以上住房或未结清住房公积金贷款的，不得申请住房公积金贷款。</p><p style="text-indent: 2em">明确在市区限购范围内，对于居民家庭首次购买普通住房(从未购置过住房且无购房贷款记录)的商业性个人住房贷款，最低首付款比例不低于30%;对于三种情形的居民家庭(申请贷款时实际没有住房但有购房贷款记录的居民家庭;拥有1套住房但没有购房贷款记录的居民家庭;拥有1套住房且相应购房贷款已结清的居民家庭)申请商业性个人住房贷款购买普通住房的，最低首付款比例调整为不低于40%;对于拥有1套住房且相应贷款未结清的居民家庭，再次申请商业性个人住房贷款购买普通住房的，最低首付款比例调整为不低于60%;对拥有2套及以上住房的居民家庭，暂停发放第3套及以上住房贷款。</p>';
          break;
        case 6:
          this.newsinfo.title = "人民币中间价大涨217点 升幅为逾一个月最大";
          this.newsinfo.add_time = "2019-07-15 17:15";
          this.newsinfo.click = 66;
          this.newsinfo.content =
            '<p style="text-indent: 2em">人民币兑美元中间价大涨217点，或0.32%，报6.7641，上调幅度为逾一个月最大，上日中间价报6.7858。上周五在岸人民币16:30收盘报6.7795，夜盘收盘报6.7810。</p><p style="text-indent: 2em">中间价公布后，人民币兑美元开盘报6.7702，上日收报6.7810。离岸人民币兑美元上涨至6.7808，稍早最低报6.7908。</p><p style="text-indent: 2em">自2016年起人民币外汇市场运行时间由北京时间9:30-16:30调整至北京时间9:30-23:30。央行此前公布，延长交易时间后，将以北京时间16:30人民币兑美元即期询价成交价作为当日收盘价。</p><p style="text-indent: 2em">中国央行2015年8月11日大幅调降人民币兑美元中间价，并宣布进一步完善中间价报价，人民币创出1994年汇率并轨以来最大单日跌幅，引发全球股市和大宗商品下跌。8月14日人民币中间价微升结束三日大贬。</p>';
          break;
        case 7:
          this.newsinfo.title = "韩寒名下餐厅”很高兴遇见你”宁波店欠债关门";
          this.newsinfo.add_time = "2019-07-14 16:42";
          this.newsinfo.click = 28;
          this.newsinfo.content =
            '<p style="text-indent: 2em">韩寒在宁波开的那家店关门了，供应商讨债都讨到杭州去了。”昨天，这个消息在宁波吃货群炸开了锅，在餐饮界也引起了不小的震动。消息来得突然，记者懵圈数秒，随后赶紧从杭州媒体同行处了解了大致经过：</p><p style="text-indent: 2em">前天中午，杭州市民孙先生，经过“很高兴遇见你”湖滨银泰店发现有人围拢在店门口，大概十来个人，男男女女，合力拉着一条横幅，横幅上写着“很高兴遇见你，还我血汗钱”。孙先生和这十几个讨债人聊天得知，他们原来是宁波店的供货商，有卖橱柜的，有供应蔬菜的，还有提供调料的，搞装修的等等，欠款都是几十万元。因为宁波店关门了，他们跑到杭州的这家店门口来讨债。当时民警过来劝阻，不过他们嚷嚷着“明天还会过来。</p><p style="text-indent: 2em">昨天上午，记者通过杭州媒体同行了解到，部分宁波店的供货商再次来到“很高兴遇见你”杭州店讨债。随后，记者致电杭州店和其所属餐饮公司了解到，韩寒本人已了解到这一情况，上海烨飨餐饮管理有限公司副总孙某一行已前往杭州协调解决此事。</p><p style="text-indent: 2em">我们杭州这家店和宁波的不一样，他们是加盟店，我们是直营的，营运和管理都是上海总部把控，目前营运正常。”杭州店店长告诉记者。</p>';
          break;
        case 8:
          this.newsinfo.title = "百度地图撕逼高德地图：谁是手机地图行业第一";
          this.newsinfo.add_time = "2019-07-14 15:36";
          this.newsinfo.click = 136;
          this.newsinfo.content =
            '<p style="text-indent: 2em">今日下午，百度地图通过官方微博正式对高德跑分喊话做出回应，百度地图方面称：你要战，我便战。跑个分出来给你看!今天友商高德很高调，不仅宣称日活已成行业第一，还喊话百度不服跑个分。但是排名不是光靠吹的，第三方的数据早已啪啪打脸。</p><p style="text-indent: 2em">据悉，今日上午，在云栖大会上，高德总裁俞永福称，根据艾瑞最新数据显示，高德地图手机客户端在日活指标上超越了百度地图。并特意强调欢迎第三方机构来检验这一结果。</p><p style="text-indent: 2em">今日下午，百度地图通过官方微博正式对高德做出回应，百度方面表示你要站，我便战，而且还表示数据不是光靠吹的，此外，引用其他第三方数据机构数据表示高德所述不实。</p><p style="text-indent: 2em">然而，剧情依然没有结束。就在晚间，高德地图对百度地图的应战做出回应，表示数据不服别吵吵，并要求百度找第三方机构进行代码监测验证。</p>';
          break;
        case 9:
          this.newsinfo.title = "苏州22家违规房企被责令整改 每平米房价4天跌9千";
          this.newsinfo.add_time = "2019-07-13 17:56";
          this.newsinfo.click = 39;
          this.newsinfo.content =
            '<p style="text-indent: 2em">中新网南京10月9日电(记者钟升)苏州市物价局8日表示，经过近半个月的商品房专项检查。目前，物价、住建等部门已联合查出22家涉嫌存在捂盘惜售、未明码标价、明码标价要素不全、标示内容更新不及时等违法违规问题的房企。另有3家企业被国家住建部通报批评。</p><p style="text-indent: 2em">自9月23日起，苏州物价、住建部门对群众反映强烈的商品房销售违法违规问题重拳出击，联合开展商品房专项检查。对于涉嫌捂盘惜售、哄抬价格的，相关部门将先行告诫，进行警示约谈，经告诫、约谈仍不改正的，依法从严从重处罚。对于涉嫌存在虚假打折、虚假优惠等价格欺诈行为的，相关部门将进行警示性约谈，降低信用等级，暂停网签，并视违法情节严重程度给予行政处罚。</p><p style="text-indent: 2em">截至7日，检查组已检查房地产开发企业65家，其中22家涉嫌存在捂盘惜售、哄抬价格、标示内容更新不及时等违法违规问题。另有，苏州朗宏置业有限公司、华润置地[0.48%](苏州)实业有限公司、苏州恒力置业有限公司等3家企业被国家住建部通报批评。</p>';
          break;
        case 10:
          this.newsinfo.title = "乐视919乐迷节44.8亿创历史记录 超级汽车融资10";
          this.newsinfo.add_time = "2019-07-12 15:35";
          this.newsinfo.click = 302;
          this.newsinfo.content =
            '<p style="text-indent: 2em">9月20日零点15分，乐视公布919乐迷节24小时战报。截至9月19日24时，乐视全生态总销售额突破44.8亿元，其中乐视会员总销售额超24.8亿元;超级电视总销量突破80.2万台，超过去年919乐迷节总销量两倍;超级手机总销量突破100.3万部，为去年919乐迷节总销量1.7倍;cool1 dual生态手机总销量超30.77万台;智能硬件总销售额超8164万元。44.8亿的销售额不仅超过预定的40亿元销售目标，也超过了去年919乐迷节和今年414硬件免费日的销售额总和。</p><p style="text-indent: 2em">晚会现场，乐视创始人贾跃亭公布了乐视超级汽车融资的最新进展。贾跃亭说，乐视超级汽车首轮融资正式完成，10.8亿美金融资额创下全球智能电动汽车产业首轮融资记录。同时，乐视首款互联网智能电动样车已经上路测试;生态汽车超级工厂落户浙江后，与之配套的超级汽车体验园及汽车生态小镇也已经在全力规划与推进。在晚会现场与明星嘉宾互动时，贾跃亭还表示将赠送中国女排主教练郎平一辆超级汽车。</p><p style="text-indent: 2em">919乐迷节的火爆，意味着乐视超级电视已成为行业绝对领导者，乐视超级手机凭借全新的生态模式，成为传统手机、互联网营销派之后的行业第三极，乐视商城也成为继平台电商和自营电商之后的又一行业巨头，意味着生态型电商已快速崛起，其一手打造的“黑色919 乐迷电商节”已坐稳中国第三大电商购物节。</p>';
          break;
        case 11:
          this.newsinfo.title = "中秋后成品油调价窗口将开 汽柴油价或小幅下调";
          this.newsinfo.add_time = "2019-07-11 17:19";
          this.newsinfo.click = 86;
          this.newsinfo.content =
            '<p style="text-indent: 2em">近期，产油国“冻产”预期的利好效应逐步弱化，恶劣天气影响下美国商业原油库存大幅下降，一度提振油价，但预计其影响难以持续。国际油价进入震荡期，整体有所上扬，但涨幅有限。国内汽柴油价“两连涨”后，本计价周期内，一揽子原油变化率大幅负向开启，随后幅度收窄，中秋假期结束后，9月18日24时调价窗口开启，汽柴油价格有望迎来小幅下调，预计每升下调约0.1元。</p><p style="text-indent: 2em">9月5日，两大产油国——沙特和俄罗斯就稳定油市发表联合声明，布伦特油价盘中大涨，但因沙特能源大臣法利赫表示，目前原油市场在稳定提升中，暂时没有必要冻结产能，当日收盘时，油价回吐大部分涨幅。分析人士认为，短期内“冻产”预期主要起到托底油价作用，即在油价大幅下跌时，产油国释放“冻产”利好，防止油价进一步下滑;但由于产油国产量普遍处于高位，“冻产”本身并不能起到持续拉升油价的作用。</p><p style="text-indent: 2em">9月8日，美国能源信息局公布，截至9月2日当周，美国商业原油库存大幅下降1450万桶，创下1999年以来的最大降幅，受此影响，当日两大基准原油期货价格双双上涨4%以上。不过，分析指出，美国原油库存大降主要是由于墨西哥湾的热带风暴影响了美国原油进口以及该地区部分原油生产，天气的影响会很快消退，并不会持续影响油价。</p>';
          break;
        case 12:
          this.newsinfo.title = "厦门等五城楼市限贷限购 或引发二线楼市调控";
          this.newsinfo.add_time = "2019-07-11 16:28";
          this.newsinfo.click = 101;
          this.newsinfo.content =
            '<p style="text-indent: 2em">记者梳理国家统计局3月-7月的70个大中城市住宅销售价格变动情况发现，今年3月至今，厦门、合肥已连续五个月交替领涨70城房价。厦门、合肥新建住宅价格环比涨幅均在4.6%-5.8%间浮动，且包揽了涨幅排行的前两位。</p><p style="text-indent: 2em">谈及二线城市房价连续领涨的原因，易居研究院智库中心研究总监严跃进告诉中新网记者，由于一线城市房价过高，部分投资、投机资金开始撤出一线城市转向二线城市，使得热点二线城市的房价涨幅超越一线城市。</p><p style="text-indent: 2em">同类型房价涨幅比较快的城市还有南京、合肥、杭州、天津、福州、惠州等。”中原地产首席分析师张大伟注意到，只要是房价上涨速度较快的城市，都有可能出台“收紧”的调控政策。</p><p style="text-indent: 2em">这会让此前不积极换房的购房者非常懊恼，因为换房成本明显增加，七成首付成为主要的购房压力。”严跃进透露，传言处于一直存在、却始终无辟谣的状态，可信度较高，预计9月底或10月初有可能出台。</p>';
          break;
      }
    }
  },

  components: {
    // 注册子组件的节点
    "comment-box": comment
  }
  // created() {
  // 	this.getNewsinfo();
  // },
  // methods: {
  // 	getNewsInfo() {
  // 		this.$http.get('api/getnew/' + this.id).then(result => {
  // 			if (result.body.status === 0) {
  // 				this.newsinfo = result.body.message[0];
  // 			} else {
  // 				Toast("获取新闻失败");
  // 			}
  // 		})
  // 	}
  // }
};
</script>>

<style lang="scss" scoped>
.newsinfo-container {
  padding: 0 4px;
  .title {
    font-size: 16px;
    text-align: center;
    margin: 15px 0;
    color: red;
  }
  .subtitle {
    font-size: 14px;
    color: #226aff;
    display: flex;
    justify-content: space-between;
  }
  // .content {

  // }
}
</style>